SimplePhotosServer/app/controllers/photos_controller.rb

  def create
    puts self.headers
    p = Photo.new(params[:photo])
    p.save!
---
INSERT INTO "photos" ("size", "created_at", "content_type", "thumbnail", "updated_at", "lng", "caption", "parent_id", "height", "filename", "lat", "width") VALUES(14668, '2010-11-21 19:17:30', 'image/jpeg', NULL, '2010-11-21 19:17:30', -97.76, 'This%20is%20a%20nice%20photo%21', NULL, 256, 'photo.jpg', 38.44, 256)